{
  "metadata": [
    {
      "Headline": "Quebec brings hammer down on doctors by adopting special law to force deal",
      "Published Date": "Published Oct 24, 2025",
      "Author": "Philip Authier",
      "Blurb": "The CAQ invoked closure to fast track Bill 2, which includes a new salary structure for physicians and imposes stiff penalties for pressure tactics."
    },
    {
      "Headline": "Habs Mailbag: Jakub Dobes passing eye test as Canadiens' No. 1 goalie",
      "Published Date": "Published Oct 25, 2025",
      "Author": "Stu Cowan",
      "Blurb": "His strong play is a big part of Habs' hot start as Samuel Montembeault's struggles continue in loss to Oilers."
    },
    {
      "Headline": "Canadiens' Patrik Laine out 3-4 months after surgery for muscle injury",
      "Published Date": "Published Oct 25, 2025",
      "Author": "Stu Cowan",
      "Blurb": "It seems unlikely the 27-year-old will remain with Montreal beyond this season after surgery in New York to repair a core muscle injury."
    },
    {
      "Headline": "'There is no big picture' for roadwork in Montreal",
      "Published Date": "Published Oct 25, 2025",
      "Author": "Linda Gyulai",
      "Blurb": "How many times can one stretch of road be ripped up? A Gazette investigation looks at several streets where the answer is: too often."
    },
    {
      "Headline": "Liberal Leader Pablo Rodriguez tells Quebec doctors: 'Please, don't leave'",
      "Published Date": "Published Oct 25, 2025",
      "Author": "Philip Authier",
      "Blurb": "\"Wait for a year, we're going to be there. We're going to sit down with you and negotiate,\" he said after the CAQ adopted a new law dictating doctor salaries."
    }
  ],
  "article_texts": [
    "The CAQ invoked closure to fast track Bill 2, which includes a new salary structure for physicians and imposes stiff penalties for pressure tactics. QUEBEC — Unable to reach a negotiated deal over a new salary structure with doctors, the Coalition Avenir Québec government Friday played hardball,adopting legislation imposing an agreementon them that includes stiff penalties for any retaliatory pressure tactics. There with you then. Here with you now. As a critical part of the community for over 2...",
    "His strong play is a big part of Habs' hot start as Samuel Montembeault's struggles continue in loss to Oilers. On a scale of 1-10, with 10 being excellent, where are the Canadiens right now? There with you then. Here with you now. As a critical part of the community for over 245 years,The Gazette continues to deliver trusted English-language news and coverage on issues that matter. Subscribe now to receive:...",
    "It seems unlikely the 27-year-old will remain with Montreal beyond this season after surgery in New York to repair a core muscle injury. The Canadiens’ Patrik Laine and his wife have both expressed how much they love Montreal and would love to stay here beyond this season. There with you then. Here with you now. As a critical part of the community for over 245 years,The Gazette continues to deliver trusted English-language news and coverage on issues that matter. Subscribe now to receive:...",
    "How many times can one stretch of road be ripped up? A Gazette investigation looks at several streets where the answer is: too often. Montrealers who think the city does construction work over and over on the same streets: it’s not your imagination. There with you then. Here with you now. As a critical part of the community for over 245 years,The Gazette continues to deliver trusted English-language news and coverage on issues that matter. Subscribe now to receive:...",
    "\"Wait for a year, we're going to be there. We're going to sit down with you and negotiate,\" he said after the CAQ adopted a new law dictating doctor salaries. TROIS-RIVIÈRES — Quebec Liberal leader Pablo Rodriguez promised Saturday to scrap the Coalition Avenir Québec government’s new law dictating doctor salaries and implored physicians thinking of leaving Quebec to sit tight. There with you then. Here with you now. As a critical part of the community for over 245 years,The Gazette continues to..."
  ]
}